read_verilog sub_32bit_signed.v 
proc; opt; fsm; memory; opt; techmap; opt
synth -top sub_32bit_signed
write_verilog synthesized.v
