read_verilog sub_8bit_signed.v 
proc; opt; fsm; memory; opt; techmap; opt
synth -top sub_8bit_signed
write_verilog synthesized.v
